// SAMPLE COMMENT
// BASIC TEST
-RESET:1#
-RESET:0#
DATABUS-WR-MODE:1#
WR-DATABUS:1234#
-TMP-REG-LD0:1#
-TMP-REG-LD0:0#
WR-DATABUS:5678#
-TMP-REG-LD1:1#
-TMP-REG-LD1:0#
WR-DATABUS:1010#
-ADDR-REG-LD0:1#
-ADDR-REG-LD0:0#
WR-DATABUS:0101#
-ADDR-REG-LD1:1#
-ADDR-REG-LD1:0#
//
DATABUS-RD-MODE:1#
-TMP-REG-RD0:1#
RD-DATABUS:0#1234!
-TMP-REG-RD0:0#
-TMP-REG-RD1:1#
RD-DATABUS:0#5678!
-TMP-REG-RD1:0#
//
ADDRBUS-RD-MODE:1#
-ADDR-REG-RD0:1#
RD-ADDRBUS:0#1010!
-ADDR-REG-RD0:0#
-ADDR-REG-RD1:1#
RD-ADDRBUS:0#0101!
-ADDR-REG-RD1:0#